try:
    x = int(input("Введите число: "))
    print(x)
except ValueError:
    print("Это не число!!!")


#Блок 1
#1. Сумма двух чисел.
x = int(input("Введите чило:"))
y = int(input("Введите 2 число:"))
print(f"Сумма двух чисел: {sum([x,y])} ")

#2. Периметр прямоугольника.
a = int(input("Введите длину прямоугольника:"))
b = int(input("Введите ширину прямоугольника:"))
print(f"Периметр прямоугольника:{(a + b) * 2}")

#3. Среднее из трёх.
q = int(input("Введите первое число:"))
w = int(input("Введите второе число:"))
e = int(input("Введите третье число:"))
print(f"Среднее из трех:{sum([q,w,e]) / 3} ")

#4. Часы и минуты.
min = int(input("Число чинут:"))
print(f"Это {min // 60}ч {min % 60} мин")

#5. Округление.
r = float(input("Введите число:"))
print(round(r,2))
print(abs(r))

#7. Степень. Запроси число и степень, выведи x ** n.
x = int(input("Введите число:"))
y = int(input("Введите сьепень"))
print(f"х в степени у:{x ** y}")